<!DOCTYPE html>
<html lang="ja">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>サンプル</title>
</head>
<body>

<h1>数値と四則演算</h1>

<?php
//数値リテラル
echo 250   , "<br />"; //整数
echo "250" , "<br />"; //文字列
echo 955   , "<br />"; //10進数
echo 034   , "<br />"; //8進数
echo 0x3A  , "<br />"; //16進数

//アルファベットは大文字、小文字で可能

echo -82,   "<br />"; //負の数
echo -0xD2, "<br />"; //負の数

//浮動小数点（固定小数点形式）
echo  2.72,    "<br />";
echo  1.42E-5, "<br />";
echo -0.72,    "<br />";
echo -8E14,    "<br />";

echo "5 * 3 = ", 5 * 3, "<br>";
echo "8 / 2 = ", 8 / 2, "<br>";
echo "3 + 6 = ", 3 + 6, "<br>";
echo "5 - 2 = ", 5 - 2, "<br>";
echo "7 % 3 = ", 7 % 3, "<br>";

//演算子の優先順位

echo "5 + 4 * 3 = ", 5 + 4 * 3, "<br>";     //17
echo "(5 + 4) * 3 = ", (5 + 4) * 3, "<br>"; //27
echo "4 / 2 * 3 = ", 4 / 2 * 3, "<br>";     //6 /と*の優先順位は同じ。左から計算。

//演算の際の型変換

//整数と浮動小数点
//整数から、浮動小数点に変換されて計算
echo "3 + 2.4 = ", 3 + 2.4, "<br>";   //5.4
echo "1.72 + 7 = ", 1.72 + 7, "<br>"; //8.72

//数値と文字列
//文字列の先頭に整数や浮動小数点数などがある場合は、
//文字列は先頭からの数値の部分の数値として変換される。
echo (int)'2008year', '<br />'; //2008
echo (float)'1.02パーセント', '<br />'; //1.02

//先頭の文字が数値でない場合は0として扱われる。
echo (int)'こんにちは', '<br />'; //0
echo (int)'year2008', '<br />'; //0

echo "5 + 2.4 = ", 5 + 2.4, '<br />'; //7.4
echo "5 + '8year' = ", 5 + (int)'8year', '<br />'; //13
echo "5 + '東京' = ", 5 + (int)'東京'; //5
?>

</body>
</html>